app/controllers/messages_controller.rb

  def create
    @message = Message.new params[:message]
    if @message.save
---
INSERT INTO "messages" ("tweet_id", "created_at", "body", "updated_at", "anonymous", "user_id") VALUES(NULL, '2010-06-24 15:35:26', 'あいうえお', '2010-06-24 15:35:26', 't', NULL)