app/controllers/secrets_controller.rb

SELECT * FROM "messages" ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
  def index
    @messages = Message.paginate(:page => params[:page], :order => 'created_at DESC')