app/controllers/statuses_controller.rb

SELECT * FROM "statuses" WHERE ("statuses"."uid" = 'aCKx3o') LIMIT 1
---
  def show
    #@status = Status.find(params[:id])
    @status = Status.find_by_uid(params[:uid])