app/controllers/statuses_controller.rb

  def index
    @statuses = Status.paginate(:page => params[:page], :per_page => @@per_page, :order => 'created_at DESC')
---
SELECT * FROM "statuses" ORDER BY created_at DESC

  def create
    @status = Status.new(params[:status])
    @status.signature = signature
    @statuses = Status.paginate(:page => params[:page], :per_page => @@per_page, :order => 'created_at DESC')

    if logged_in?
      @status.user = current_user
      @status.anonymous = false
    end

    if @status.save
---
SELECT * FROM "statuses" ORDER BY created_at DESC
INSERT INTO "statuses" ("tweet_id", "created_at", "updated_at", "text", "anonymous", "uid", "user_id") VALUES(NULL, '2010-06-24 17:11:21', '2010-06-24 17:11:21', 'あいうえお', 'f', 'CqtuS6', 1)